;***************************************************************************************************
;* Description:  清RAM
;***************************************************************************************************
CLEAR_RAM: 
	CLR 		MPH0
    MOV       	A,#0x00
    MOV       	MPL0,A
    
CLEAR_RAM1:
    CLR       	IAR0
    INCR      	MPL0
    MOV       	A,MPL0
    SE 			#0xF0
    JMP 		CLEAR_RAM1
    RET  
;***************************************************************************************************
;* Description:  GPIO初始化
;***************************************************************************************************
GPIO_INIT:
	CLR			P0					;输出初始为0 	
	CLR			P0OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P0OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P0PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P0PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P0WK,A				
	
    CLR			P1					;输出初始为0 
	CLR			P1OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P1OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P1PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P1PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P1WK,A	    
	RET   	
;***************************************************************************************************
;* Description:  PWM初始化
;***************************************************************************************************
PWM_INIT:
	;1、配置时钟源选择T1CKS:不分频；
    BCLR		T1FS2 
    BCLR		T1FS1
    BCLR		T1FS0   
    
    ;2、配置T1OVR，输出PWM频率 = 80000/(0X3FF-0x338+1) = 40k  
    MOV			A,#0x38 
    MOV			T1OVRL,A
    MOV 		A,#0x03
    MOV 		T1OVRH,A
 
    ;配置T1Dx，输出PWM占空比 = (0x39B-0x338+1)/（0x3FF-0x338+1）=1/2；
    MOV			A,#0x9B   
    MOV 		T1D0L,A
    MOV 		T1D1L,A
    MOV 		T1D2L,A
    MOV 		T1D3L,A
    MOV 		T1D4L,A
    
    MOV 		A,#0x03
    MOV 		T1D0H,A
    MOV 		T1D1H,A
    MOV 		T1D2H,A
    MOV 		T1D3H,A
    MOV			T1D4H,A
       
	;3、配置 PWMxS,先输出高电平，占空比为高电平宽度；
    MOV 		A,#00000000B
    MOV 		T1CON2,A
   	
    ;4、使能 Timer1；
    BSET		T1EN    
	RET     
;***************************************************************************************************
;* Description:  外部中断初始化
;***************************************************************************************************   
INT_INIT:
	BSET		EINT1				;INT1使能
	BCLR		INT1S1
	BSET		INT1S0				;10 上升延触发  01  下降延触发    00低电平触发
	BSET		INT1IE				;使能外部中断1
	RET
;***************************************************************************************************
;* Description:  Timer_Init
;***************************************************************************************************   
TIMER0_INIT: 
	BSET		T0FS2    		;128分频     8000/128=62.5
    BSET		T0FS1  			
    BSET		T0FS0   
    
    MOV			A,#06H      	;4MS
    MOV			T0OVR,A         ;62.5K/(0XFF-6+1)   
        					
	BSET 		T0IE  
	BSET 		T0EN  
	
	RET 
	
;******************************************************************************  
;* Description:  WDT初始化  
;******************************************************************************	
WDT_INIT:
	BSET 		LRCEN  ;1：使能RC32K时钟  0：禁止RC32K时钟
	BCLR 		PS2
	BCLR		PS1
	BCLR		PS0   ;一分频
	;注意 需要配置代码选项区 0X7FCH 例如 SUT[2：0]  = 000→PWRT = WDT prescaler rate = 144ms 
    BSET		WDTEN  ;1：使能WDT   0：禁止WDT 
	RET     
	
	   
