;********************************************************************************************************
;公司名称 		: 湖南品腾电子科技有限公司
;作者     		: PTKJ
;创建时间 		: 2021-06-28
;修改时间		    : 2021-06-28 
;说明 			: LVD/LVR_DEMO
;版本号 		    : V1.0
;功能描述：

		;在烧录软件设置（代码选项区LVREN与LVRSEL[2:0]） LVR低电压复位 2.0V      
		;>2.0V  P10翻转   <2.0V P10口为低电平
			
		;LVD 低电压检测，设置电压检测点为2.9V
		;上电电压为5V，P00输出为高，电压往下调，<2.9V，P00输出为低，>2.9V，P00输出为高
;********************************************************************************************************


;包含的头文件列表
include	   PT8M2302.INC

        ORG     0000H
        CALL    SYSTEM_INIT		   ;初始化程序	
        JMP     MAIN               ;复位入口地址，跳转到复位程序区
        ORG     0008H
        JMP     LOW_INTERRUPT      ;低优先级
        ORG     0018H
        JMP     HIGH_INTERRUPT     ;高优先级
;***************************************************************************************************
;* Description:  中断函数入口     
;***************************************************************************************************
LOW_INTERRUPT:
        ;添加低优先级中断处理代码
		BCLR 	DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
    	RETI

HIGH_INTERRUPT:
		;添加高优先级中断处理代码
		BCLR 	DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
		RETI
      
;***************************************************************************************************
;* Description:  主程序
;***************************************************************************************************
MAIN:
	;LVR TEST
	BCPL 		P10
	;LVD TEST
    BTSNZ 		LVDOUT
    BSET 		P00
    BTSZ 		LVDOUT
    BCLR 		P00
    JMP         MAIN
        
INCLUDE		PT_CODE.asm        
        
END