;********************************************************************************************************
;公司名称 		: 湖南品腾电子科技有限公司
;作者     		: PTKJ
;创建时间 		: 2022-03-29
;修改时间			: 2022-03-29 
;说明 			: ADC_DEMO
;版本号 			: V1.0     初版
;				: V1.1	   增加ADC0输入电压单次采集比较功能  
;               : V1.2     ADC失调校准目标值更新，ADC模块电路0.5mA     
;功能描述：
		;ADC通道选择	ADC0(P03)做为ADC功能   选择内部基准电压2.048V做为参考电压	 
		;ADC0输入电压 >= 1V时，P00输出高；反之,P00输出低；
;*****************************************************

;包含的头文件列表
INCLUDE	   			PT8M2302.INC
INCLUDE				PT_CODE.INC
        ORG     	0000H
        CALL    	SYSTEM_INIT		   ;初始化程序	
        JMP     	MAIN               ;复位入口地址，跳转到复位程序区
        ORG     	0008H
        JMP     	LOW_INTERRUPT      ;低优先级
        ORG     	0018H
        JMP     	HIGH_INTERRUPT     ;高优先级
;***************************************************************************************************
;* Description:  中断函数入口     
;***************************************************************************************************
LOW_INTERRUPT:
        ;添加低优先级中断处理代码
        BCLR 		DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
        BTSNZ		ADCIF  
		RETI  	
		BCLR		ADCIF  
	    RETI

		
HIGH_INTERRUPT:
		;添加高优先级中断处理代码
		BCLR		DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
		RETI
      
;***************************************************************************************************
;* Description:  主程序
;***************************************************************************************************
MAIN:
		CALL    	ADC_SINGLE_PRO  ;单次转换处理 
		CALL 		ADC_DATA_COMP   ;ADC0输入电压比较
    	JMP     	MAIN
        
INCLUDE		PT_CODE.asm        
        
END