;********************************************************************************************************
;公司名称 		: 湖南品腾电子科技有限公司
;作者     		: PTKJ
;创建时间 		: 2021-06-28 
;修改时间			: 2021-06-28  
;说明 			: TIMER0_DEMO
;版本号 			: V1.0
;功能描述：
		;T0中断  		P10 25us翻转一次
;********************************************************************************************************
	
;包含的头文件列表
include	   PT8M2302.INC

        ORG     0000H
        CALL    SYSTEM_INIT		   ;初始化程序	
        JMP     MAIN               ;复位入口地址，跳转到复位程序区
        ORG     0008H
        JMP     LOW_INTERRUPT      ;低优先级
        ORG     0018H
        JMP     HIGH_INTERRUPT     ;高优先级
;***************************************************************************************************
;* Description:  中断函数入口     
;***************************************************************************************************
LOW_INTERRUPT:
        ;添加低优先级中断处理代码
		BCLR 	DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
        BTSNZ	T0IF
	    RETI
	    BCLR	T0IF
	    BCPL	P10
	   ;T0C计满后产生中断，值重装载为0x38；
    	RETI

HIGH_INTERRUPT:
		;添加高优先级中断处理代码
		BCLR 	DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
		RETI
      
;***************************************************************************************************
;* Description:  主程序
;***************************************************************************************************
MAIN:
		JMP     MAIN
        
INCLUDE		PT_CODE.asm        
        
END