;***************************************************************************************************
;* Description:  系统初始化
;***************************************************************************************************
SYSTEM_INIT:
	CALL 		CLEAR_RAM
	CALL		GPIO_INIT
	CALL 		TIMER0_INIT 
	BCLR		WDTEN  
    RET
        
;***************************************************************************************************
;* Description:  清RAM
;***************************************************************************************************
CLEAR_RAM: 
	CLR 		MPH0
    MOV       	A,#0x00
    MOV       	MPL0,A
    
CLEAR_RAM1:
    CLR       	IAR0
    INCR      	MPL0
    MOV       	A,MPL0
    SE 			#0xF0
    JMP 		CLEAR_RAM1
    RET   
    
;******************************************************************************
; Function   :  GPIO_Init
; Description:  GPIO初始化程序 
; Input      :  
; Output     :  
;******************************************************************************        
GPIO_INIT:     
	CLR			P0					;输出初始为0 	
	CLR			P0OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P0OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P0PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P0PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P0WK,A			
	
    CLR			P1					;输出初始为0 
	CLR			P1OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P1OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P1PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P1PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P1WK,A	    
	RET     
	
;***************************************************************************************************
;* Description:  TIMER0_INIT初始化程序 
;***************************************************************************************************   
TIMER0_INIT: 
	;1、配置时钟源选择T0CKS:不分频；
    BCLR 		T0FS2 
    BCLR 		T0FS1
    BCLR		T0FS0   
    
    ;2、配置T0OVR，80000/(0XFF-0x38+1)=40k   1000/40K=25us计数溢出
    MOV			A,#0x38      			
    MOV			T0OVR,A   
	
    ;3. 使能 Timer0；  								  								 								 								
    BSET 		T0EN  
							
	BSET 		T0IE                ;使能TIMER0中断  
	BSET		GIE					;开启全局中断
	;IPEN默认为低 即禁止中断优先级
    	
	RET    
  