;***************************************************************************************************
;* Description:  系统初始化
;***************************************************************************************************
SYSTEM_INIT:
	CALL		GPIO_Init
	CALL 		CLEAR_RAM
	BCLR 		WDTEN
    RET
        
;***************************************************************************************************
;* Description:  清RAM
;***************************************************************************************************
CLEAR_RAM: 
	CLR 		MPH0
    MOV       	A,#0x00
    MOV       	MPL0,A
    
CLEAR_RAM1:
    CLR       	IAR0
    INCR      	MPL0
    MOV       	A,MPL0
    SE 			#0xF0
    JMP 		CLEAR_RAM1
    RET   
    
;******************************************************************************
; Function   :  GPIO_Init
; Description:  GPIO初始化程序 
; Input      :  
; Output     :  
;******************************************************************************        
GPIO_Init:     
	MOV 		A,#00000001B
	MOV 		P0,A				;P00输出为高，其余IO输出为0 	
	CLR			P0OD				;1为使能开漏
	MOV			A,#00001110B		;1为输入	 0为输出
	MOV			P0OE,A		
    MOV			A,#11110110B		;0为使能上拉  默认 1
	MOV			P0PH,A
	MOV			A,#00000110B		;1为使能下拉  默认 0	
	MOV			P0PD,A				
    MOV			A,#00000100B		;1为使能唤醒   
	MOV			P0WK,A				
	
    CLR			P1					;输出初始为0 
	CLR			P1OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P1OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P1PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P1PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P1WK,A	    
	RET      