;********************************************************************************************************
;公司名称 		: 湖南品腾电子科技有限公司
;作者     		: PTKJ
;创建时间 		: 2021-06-29 
;修改时间		    : 2021-06-29 
;说明	  		: INT_DEMO
;版本号	  		: V1.0
;功能描述 		: 
		;代码选项区 INT1  1->P01输入,请烧录软件设置正确
		;GPIO初始化 P00内部下拉 P01内部上拉
		;外部中断0，P00上升沿触发,;产生外部中断0 则P10翻转
		;外部中断1，P01低电平触发;产生外部中断1 则P11翻转
;********************************************************************************************************


;包含的头文件列表
include	   PT8M2302.INC

        ORG     	0000H
        CALL		SYSTEM_INIT		   ;初始化程序	
        JMP			MAIN               ;复位入口地址，跳转到复位程序区
        ORG			0008H
        JMP			LOW_INTERRUPT      ;低优先级
        ORG			0018H
        JMP			HIGH_INTERRUPT     ;高优先级
;***************************************************************************************************
;* Description:  中断函数入口     
;***************************************************************************************************
LOW_INTERRUPT:
        ;添加低优先级中断处理代码
		BCLR 		DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
        BTSNZ		INT0IF
		RETI
		BCLR		INT0IF
	    BCPL		P10    ;产生外部中断0 则P10翻转
    	RETI

HIGH_INTERRUPT:
		;添加高优先级中断处理代码
		BCLR 		DPAGE0   ;使用TOUCH库时SRAM需要切换至DPAGE到0页
		BTSNZ		INT1IF
		RETI
		BCLR		INT1IF
		BCPL		P11 	;产生外部中断1 则P11翻转
		RETI
      
;***************************************************************************************************
;* Description:  主程序
;***************************************************************************************************
MAIN:
	    NOP
	    JMP			MAIN
        
INCLUDE		PT_CODE.asm        
        
END