;***************************************************************************************************
;* Description:  系统初始化
;***************************************************************************************************
SYSTEM_INIT:
	CALL		GPIO_Init
	CALL 		CLEAR_RAM
	CALL		INTS_Init
	BCLR 		WDTEN
    RET
        
;***************************************************************************************************
;* Description:  清RAM
;***************************************************************************************************
CLEAR_RAM: 
	CLR 		MPH0
    MOV       	A,#0x00
    MOV       	MPL0,A
    
CLEAR_RAM1:
    CLR       	IAR0
    INCR      	MPL0
    MOV       	A,MPL0
    SE 			#0xF0
    JMP 		CLEAR_RAM1
    RET   
    
;******************************************************************************
; Function   :  GPIO_Init
; Description:  GPIO初始化程序 
; Input      :  
; Output     :  
;******************************************************************************        
GPIO_Init:     
	CLR			P0					;输出初始为0 	
	CLR			P0OD				;1为使能开漏
	MOV			A,#00000011B		;1为输入	 0为输出
	MOV			P0OE,A		
    MOV			A,#11111101B		;0为使能上拉  默认 1
	MOV			P0PH,A
	MOV			A,#00000001B		;1为使能下拉  默认 0	
	MOV			P0PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P0WK,A				
	
    CLR			P1					;输出初始为0 
	CLR			P1OD				;1为使能开漏
	MOV			A,#00000000B		;1为输入	 0为输出
	MOV			P1OE,A		
    MOV			A,#11111111B		;0为使能上拉  默认 1
	MOV			P1PH,A
	MOV			A,#00000000B		;1为使能下拉  默认 0	
	MOV			P1PD,A				
    MOV			A,#00000000B		;1为使能唤醒   
	MOV			P1WK,A	    
	RET     
	
;***************************************************************************************************
;* Description:  INTS_Init
;***************************************************************************************************   
INTS_Init:
    BSET 		EINT1   ;外部中断1使能 
	BSET 		EINT0   ;外部中断0使能  

    BCLR		INT1S1  
    BCLR		INT1S0	;P01低电平触发

    BSET		INT0S1   
    BCLR		INT0S0  ;P00上升沿触发
    
    BSET		INT1IE	;使能外部中断1 
    BSET		INT0IE	;使能外部中断0 
    
    BCLR 		INT0IP  ;INT0设为低优先级
    BSET 		INT1IP  ;INT1设为高优先级
    
    BSET 		IPEN  
    BSET		GIEL    
    BSET  		GIEH
    
    RET;	 
	   